In [9]:
import pandas as pd 

obj = {
    "student_id": ['s1', 's2', 's3', 's4', 's5', 's6'], 
    'stat_score': [55, 90, 85, 10, 88, 99],
    "math_score": [65, 99, 67, 70, 57, 80],
}

df = pd.DataFrame(obj)
df

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
3         s4          10          70
4         s5          88          57
5         s6          99          80

In [11]:
q1 = df["stat_score"].quantile(0.25)
q3 = df["stat_score"].quantile(0.75)
iqr = q3 - q1 

lower = q1 - (iqr * 1.5)
upper = q3 + (iqr * 1.5)

print(lower)
print(upper)

df[(df['stat_score'] < lower) | (df['stat_score'] > upper)]

22.0
130.0

  student_id  stat_score  math_score
3         s4          10          70

In [12]:
df[df["stat_score"] >= 90]

  student_id  stat_score  math_score
1         s2          90          99
5         s6          99          80

In [16]:
# 이상치 제거

df = df[(df["stat_score"] > lower) & (df["stat_score"] < upper )]

In [15]:
df

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
3         s4          10          70
4         s5          88          57
5         s6          99          80

In [17]:
df

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
4         s5          88          57
5         s6          99          80